10/data/attachments/f8e5234138bda008.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_9ea7829f-6e42-42c6-bed8-bc3abca5e30d</nif:username>
            <nif:friendToBeAdded>Theresa_happy_Friend_79317_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>